// Підготовка роботи з веб-сторінкою.
// Заміна події windows.onload
// 1.
// $(document).ready(function () {

// })

// 2
// $(function () {

// })

// Селектори

$(function () {

    // Як доступитись до елемента в jQuery
    // $(селектор)

    // Селектор:
    // 1. $('*') - вибір всіх елементів на сторінці.
    // 2. $("назва_тегу") - вибір всіх елементів з "назва_тегу".
    // 3. $("E, G, H") - вибір всіх елементів з назвою тегу "E, G, H".
    // Групування селекторів.
    // 4. $('E G') - Вибір вкладених елементів. Вибір всіх вкладених елементів, які є "G", які є вкладені в контейнер "E"
    // 5. $("E + F") - Вибір сусідніх елементів. Вибір всіх елементів з назвою тегу F
    // 6. $("E:has(F)") - відвідає всім елементам тега Е, які мають хоча би один вкладений елемент з назвою тегу F.
    // 7. $(".назва_класу") - вибір всіх елементів з класом "назва_класу"
    // 8. $("#ID") - вибір елемента з ID "ID"
    // 9. $("Е[attr]") - де Е - назва тегу, а attr - назва атрибута. Доступ до елемента з атрибутом.
    // 10. $("E[attr=value]") - де Е - назва тегу, а attr - назва атрибута, а value - значення атрибута. Доступ до елемента з атрибутом по його значенню.


    // методи:
    // css("властивість", "значення") - метод, який дозволяє додати CSS-стилі елементам.
    // val() | val("text") - метод, який дозволяє отримати значення з атрибута value.
    // Якщо в дужки передати значення, то воно замінить значення в атрибуті value.

    // 1.
    // $('*').css('text-align', 'center')
    // 2.
    // $('li')
    //     .css('background-color', 'black')
    // 3.
    // $('p, a')
    //     .css('color', 'red')
    // 4.
    // $('div p')
    //     .css('font-style', 'italic')
    // 5.
    // $('p + div')
    //     .css('color', 'red')
    // 6.
    // $('div:has(ul)')
    //     .css('background-color', 'red')
    // 7.
    // $('.p1')
    //     .css('color', 'red')
    // 8.
    // $('#p2')
    // .css('color', 'red')
    // 9.   // document.querySelector('a[target]) - Доступ через чистий JS
    // $('a[target]')
    //     .css('color', 'red')
    // 10.
    // $('input[type=password]')
    //     .css('color', 'red')
    //     .val('skdfjkasjfksadj')
    //     let a = $('input[type=password]')
    // alert(a.val())


})